programming/misc/scrap.html
---
title: "Scrap"
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-02 Sun 18:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Scrap</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Victor Chen" />
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Scrap</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org85e26a7">1 System Design Cheatsheet</a>
<ul>
<li><a href="#org9e4e392">1.1 Basic Steps</a>
<ul>
<li><a href="#orgde0187d">1.1.1 Scoping</a></li>
<li><a href="#orgdcbe55c">1.1.2 Abstract Design</a></li>
<li><a href="#org5bd22b6">1.1.3 Component Design</a></li>
<li><a href="#org35678ce">1.1.4 Bottlenecks</a></li>
<li><a href="#orgc71d035">1.1.5 Scaling</a></li>
</ul>
</li>
<li><a href="#org30a17d1">1.2 Key Topics</a>
<ul>
<li><a href="#org57aa032">1.2.1 Caching</a></li>
<li><a href="#org83339c8">1.2.2 Load Balancing</a></li>
<li><a href="#orgdf37426">1.2.3 Database</a></li>
</ul>
</li>
<li><a href="#org04eba3d">1.3 Links</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org85e26a7" class="outline-2">
<h2 id="org85e26a7"><span class="section-number-2">1</span> System Design Cheatsheet</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org9e4e392" class="outline-3">
<h3 id="org9e4e392"><span class="section-number-3">1.1</span> Basic Steps</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-orgde0187d" class="outline-4">
<h4 id="orgde0187d"><span class="section-number-4">1.1.1</span> Scoping</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Clarify and agree on the scope of the system.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="no-border">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>User cases</b></th>
<th scope="col" class="org-left">Who is going to use it?</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">How (as a sequence of events) are they going to use it?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Constraints</b></td>
<td class="org-left">Traffic: requests per second, requests types etc.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Data handling: data input/output per second etc.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Multithreading etc.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgdcbe55c" class="outline-4">
<h4 id="orgdcbe55c"><span class="section-number-4">1.1.2</span> Abstract Design</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Sktech high level architecture of important components and connections between them. For example:
</p>

<ul class="org-ul">
<li>Load balancer</li>
<li>Application layer (web server)</li>
<li>Data storage layer (master/slave, database cluster etc.)</li>
<li>Caching layer</li>
<li>Other services</li>
</ul>
</div>
</div>

<div id="outline-container-org5bd22b6" class="outline-4">
<h4 id="org5bd22b6"><span class="section-number-4">1.1.3</span> Component Design</h4>
<div class="outline-text-4" id="text-1-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="no-border">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>APIs</b></th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>OO</b></td>
<td class="org-left">Map features to modules/classes.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Relations and patterns: singleton, composition, inheritance etc.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Database schema</b></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org35678ce" class="outline-4">
<h4 id="org35678ce"><span class="section-number-4">1.1.4</span> Bottlenecks</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
Identify and mitigate bottlenecks. E.g.
</p>

<ul class="org-ul">
<li>Bottleneck: data volume is too large ot database is too slow.</li>
<li>Mitigation: Distribute data on multiple machines, or add in-memory caching.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc71d035" class="outline-4">
<h4 id="orgc71d035"><span class="section-number-4">1.1.5</span> Scaling</h4>
<div class="outline-text-4" id="text-1-1-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="no-border">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Vertical</b></th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Horizontal</b></td>
<td class="org-left">Caching</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Load balancing</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Database partitioning, map-reduce</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org30a17d1" class="outline-3">
<h3 id="org30a17d1"><span class="section-number-3">1.2</span> Key Topics</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-org57aa032" class="outline-4">
<h4 id="org57aa032"><span class="section-number-4">1.2.1</span> Caching</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Caching generally refers to in-memory caches, such as Memcached and Redis.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="no-border">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Application caching</b></th>
<th scope="col" class="org-left">Check if a key exists in cache. If not, retrieve from database.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Database caching</b></td>
<td class="org-left">Database's default config usually provides some degree of caching.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">There are more advanced optimizations, such as MySQL InnoDB buffer pool and query cache.</td>
</tr>
</tbody>
</table>

<p>
Caching strategies:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="no-border">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Pre-calculation</b></th>
<th scope="col" class="org-left">Pre-calculate expensive data and store in cache.</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">E.g. suggestion data, aggregation data.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Hot data</b></td>
<td class="org-left">Store more frequently used data in faster cache.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org83339c8" class="outline-4">
<h4 id="org83339c8"><span class="section-number-4">1.2.2</span> Load Balancing</h4>
<div class="outline-text-4" id="text-1-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="no-border">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Smart client</b></th>
<th scope="col" class="org-left">Client-side load balancing, more difficult to use.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Hardware load balancer</b></td>
<td class="org-left">Reliable but expensive.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Software load balancer</b></td>
<td class="org-left">Most used.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgdf37426" class="outline-4">
<h4 id="orgdf37426"><span class="section-number-4">1.2.3</span> Database</h4>
<div class="outline-text-4" id="text-1-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="no-border">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Replication</b></th>
<th scope="col" class="org-left">Replicating changes between distributed databases to synchronize data.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Partitioning</b></td>
<td class="org-left">Decomposing data tables vertically (column-wise) or horizontally (row-wise, also called sharding).</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org04eba3d" class="outline-3">
<h3 id="org04eba3d"><span class="section-number-3">1.3</span> Links</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li><a href="https://gist.github.com/vasanthk/485d1c25737e8e72759f">System Design Cheatsheet</a></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Victor Chen</p>
<p class="date">Created: 2020-02-02 Sun 18:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
